Repository: MarcTM01/rwth-mensa-butler
Catalog: alexa-skill/lambda-pdm/src/locales/*/LC_MESSAGES/skill.po
Languages: de_de

# LANG_ID
source: en
de_de: de

# LAUNCH_MESSAGE
source: Welcome to this skill for the mensa of RWTH-Aachen University. You can ask me about the cafeteria menu.
de_de: Willkommen! Du kannst mich nach dem Speiseplan der Mensen der RWTH-Aachen fragen. Wie kann ich dir helfen?

# CANCEL_MESSAGE
source: Goodbye!
de_de: Auf Wiedersehen!

# ERROR_MESSAGE
source: Sorry, I had technical difficulties doing what you asked. Please try again. If the problem persists, please open an issue on GitHub.
de_de: Entschuldigung, ich hatte technische Probleme mit Ihrer Anfrage. Bitte versuchen Sie es erneut. Sollte das Problem länger bestehen, erstellen Sie bitte ein <lang xml:lang='en-US'>issue</lang> auf <lang xml:lang='en-US'>GitHub</lang>.

# HELP_MESSAGE
source: You can ask me about the menu in all RWTH Aachen canteens. For example, ask me: 'What dishes are served at mensa academica today?' or 'What vegetarian dishes are served at mensa academica tomorrow?'. How can I help you?
de_de: Sie können mich nach dem Speiseplan aller Mensen der RWTH Aachen fragen. Fragen Sie mich zum Beispiel: 'Was gibt es heute in der Mensa Academica?' oder 'Was gibt es morgen für vegetarische Gerichte in der Mensa Ahornstraße?'. Wie kann ich Ihnen helfen?

# FALLBACK_MESSAGE
source: Sorry, I can't process this request. This may be because I don't yet know your chosen query wording or I don't support the function. If you'd like, feel free to create an issue on GitHub to improve the skill.
de_de: Entschuldigung, ich kann diese Anfrage nicht verarbeiten. Dies kann daran liegen, dass ich Ihre gewählte Anfragenformulierung noch nicht kenne oder ich die Funktion nicht unterstütze. Wenn Sie möchten, können Sie gern ein <lang xml:lang='en-US'>issue</lang> auf <lang xml:lang='en-US'>GitHub</lang> erstellen, um den Skill zu verbessern.

# NO_MENU_DATA_FOR_DATE
source: I'm sorry, I don't have any menu data for {0} at {1}. It's possible that {0} is closed that day or you are asking for data too far in the future or the past.
de_de: Entschuldigung, ich habe keine Menüdaten für {0} am {1}. Es ist möglich, dass {0} an diesem Tag geschlossen ist oder Sie nach Daten fragen, die zu weit in der Zukunft oder Vergangenheit liegen.

# NO_MENU_DATA_FOR_WEEKEND
source: I'm sorry, I don't have any menu data for {mensa} at {date}. But this is not surprising as {date} is a {weekday}.
de_de: Entschuldigung, ich habe keine Menüdaten für {mensa} am {date}. Aber das ist nicht überraschend, da {date} ein {weekday} ist.

# NO_MENU_DATA_FOR_PUBLIC_HOLIDAY
source: I'm sorry, I don't have any menu data for {mensa} at {date}. But this is not surprising as {date} is a public holiday in northrhine westphalia.
de_de: Entschuldigung, ich habe keine Menüdaten für {mensa} am {date}. Aber das ist nicht überraschend, da {date} ein Feiertag in Nordrhein-Westfalen ist.

# EMPTY_LIST
source: empty
de_de: leer

# LIST_CONJUNCTION
source: and
de_de: und

# LIST_DISJUNCTION
source: or
de_de: oder

# DISH_CONTENT_EMPTY
source: nothing
de_de: nichts

# DISH_CONTENT_PRIMARY_SECONDARY_BARRIER
source: with
de_de: mit

# DISH_CONTENT_FURTHER_CONJUNCTION
source: and
de_de: und

# DISH_ANNOUNCEMENT_PREFIX
source: I'm happy to provide you with the menu for {mensa} on {date}.
de_de: Hier das Menü für die {mensa} am {date}:

# NUMBER_OF_ADDITIONAL_DISHES
source: Additionally, there are {0} other dishes to choose from: {1}.
de_de: Zusätzlich gibt es {0} weitere Gerichte zur Auswahl: {1}.

# ONE_ADDITIONAL_DISH
source: Additionally, there is one other dish to choose from: {0}.
de_de: Zusätzlich gibt es ein weiteres Gericht zur Auswahl: {0}.

source: vegetarian
de_de: vegetarisch

# FILTERED_DISH_ANNOUNCEMENT_NO_DISHES
source: Unfortunately, no {type} are offered at {mensa} on {date}.
de_de: Es gibt leider keine {type} in der {mensa} am {date}.

# FILTERED_DISH_ANNOUNCEMENT_ONE_DISH
source: There is one {type} offered at {mensa} on {date}: {dish}.
de_de: Es gibt ein {type} in der {mensa} am {date}: {dish}.

# FILTERED_DISH_ANNOUNCEMENT_MULTIPLE_DISHES
source: There are {num} {type} to choose from at {mensa} on {date}: {dishes}.
de_de: Es gibt {num} {type} in der {mensa} am {date}: {dishes}.

# ANNOUNCEMENT_PREPOSITION_TABLE_DISH
source: The stew has {contents}
de_de: Als Tellergericht gibt es {contents}

# ANNOUNCEMENT_PREPOSITION_VEGETARIAN_TABLE_DISH
source: The vegetarian table dish has {contents}
de_de: Als vegetarisches Tellergericht gibt es {contents}

# ANNOUNCEMENT_PREPOSITION_VEGETARIAN
source: The vegetarian dish has {contents}
de_de: Das vegetarische Gericht ist {contents}

# ANNOUNCEMENT_PREPOSITION_CLASSICS
source: The classical dish has {contents}
de_de: Im Klassiker gibt es {contents}

# ANNOUNCEMENT_PREPOSITION_PASTA
source: The pasta dish has {contents}
de_de: Als Nudelgericht gibt es {contents}

# ANNOUNCEMENT_PREPOSITION_WOK
source: The wok contains {contents}
de_de: Im Wok gibt es {contents}

# ANNOUNCEMENT_PREPOSITION_PIZZA_OF_THE_DAY
source: The pizza of the day is {contents}
de_de: Die Pizza des Tages ist {contents}

# ANNOUNCEMENT_PREPOSITION_PIZZA_CLASSICS
source: The classical pizza is {contents}
de_de: Die Pizza Classics ist {contents}

# ANNOUNCEMENT_PREPOSITION_BURGER_CLASSICS
source: The classical burger is {contents}
de_de: Als Burger gibt es {contents}

# ANNOUNCEMENT_PREPOSITION_BURGER_OF_THE_WEEK
source: The burger of the week is {contents}
de_de: Der Burger der Woche ist ein {contents}

# ANNOUNCEMENT_PREPOSITION_UNKNOWN
source: The unusual {name} has {contents}
de_de: Das unbekannte Gericht {name} ist {contents}

# EXTRAS_EMPTY
source: There are no side dishes.
de_de: Es gibt keine Beilagen.

# EXTRAS_FORMAT
source: As a side dish, you can choose from: {0}.
de_de: Als Beilage gibt es {0}.

# DAY_0
source: Monday
de_de: Montag

# DAY_1
source: Tuesday
de_de: Dienstag

# DAY_2
source: Wednesday
de_de: Mittwoch

# DAY_3
source: Thursday
de_de: Donnerstag

# DAY_4
source: Friday
de_de: Freitag

# DAY_5
source: Saturday
de_de: Samstag

# DAY_6
source: Sunday
de_de: Sonntag

# FILTER_VEGETARIAN_SINGLE
source: vegetarian dish
de_de: vegetarisches Gericht

# FILTER_VEGETARIAN_PLURAL
source: vegetarian dishes
de_de: vegetarische Gerichte

# FILTER_VEGAN_SINGLE
source: vegan dish
de_de: veganes Gericht

# FILTER_VEGAN_PLURAL
source: vegan dishes
de_de: vegane Gerichte

# FILTER_CLASSICS_SINGLE
source: classical dish
de_de: Klassiker

# FILTER_CLASSICS_PLURAL
source: classical dishes
de_de: Klassiker

# FILTER_PASTA_SINGLE
source: pasta dish
de_de: Nudelgericht

# FILTER_PASTA_PLURAL
source: pasta dishes
de_de: Nudelgerichte

# FILTER_WOK_SINGLE
source: Wok dish
de_de: Wokgericht

# FILTER_WOK_PLURAL
source: Wok dishes
de_de: Wokgerichte

# FILTER_PIZZA_PLURAL
source: Pizzas
de_de: Pizzen

# FILTER_BURGER_PLURAL
source: Burgers
de_de: Burger

# FILTER_TABLE_DISH_SINGLE
source: Table dish
de_de: Tellergericht

# FILTER_TABLE_DISH_PLURAL
source: Table dishes
de_de: Tellergerichte
